src/cf/Catalogs/HotelRooms.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>HotelRooms</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.RoomType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalInformation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.RoomStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Capacity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Used</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CapacityShow</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/HotelBookingHistory.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>HotelBookingHistory</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Room</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.HotelRooms</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Veterinarian</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>EndTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StartTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Duration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>DogOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DogOwners</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Dog</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dogs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/RoomStatus.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>RoomStatus</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Available</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Pending</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InUsed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Full</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/HotelRooms/Forms/ListForm/Ext/Form/Module.bsl
&AtClient
Procedure StatusRoom(Command)
	OpenForm("Catalog.HotelRooms.Form.HotelRoomsStatus");
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	SetCapacityShow();
	GetCapacity();
EndProcedure

Procedure SetCapacityShow()
	Hotel = Catalogs.HotelRooms.Select(); 
	While Hotel.Next() Do
		HotelObj = Hotel.GetObject();
		HotelObj.CapacityShow = String(HotelObj.Used) + "/"+String(HotelObj.Capacity); 
		HotelObj.Write();
	EndDo
EndProcedure

Procedure GetCapacity()
	Hotel = Catalogs.HotelRooms.Select(); 
	While Hotel.Next() Do
		HotelObj = Hotel.GetObject();
		HotelObj.Used = 0;
		HotelObj.CapacityShow = String(HotelObj.Used) + "/"+String(HotelObj.Capacity);
		HotelObj.Status = Enums.RoomStatus.Available;
		HotelObj.Write();
	EndDo;
	
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	COUNT(HotelBookingHistory.Room) AS Quantity,
	|	HotelBookingHistory.Room AS NameRoom
	|FROM
	|	InformationRegister.HotelBookingHistory AS HotelBookingHistory
	|WHERE
	|	HotelBookingHistory.EndTime >= &CurrentDate
	|
	|GROUP BY
	|	HotelBookingHistory.Room";
	
	Query.SetParameter("CurrentDate", CurrentDate());
	
	Result = Query.Execute();
	
	Selection = Result.Select();
	
	While Selection.Next() Do
		ObjRoom = Selection.NameRoom.GetObject();
		If Selection.Quantity = ObjRoom.Capacity Then
			ObjRoom.Status = Enums.RoomStatus.Full;
		Else
			ObjRoom.Status = Enums.RoomStatus.InUsed;
		EndIf;
		ObjRoom.Used = Selection.Quantity;
		ObjRoom.CapacityShow = String(ObjRoom.Used)+"/"+String(ObjRoom.Capacity);
		ObjRoom.Write();	
	EndDo;
EndProcedure

&AtClient
Procedure CapacityOnChange(Item)
EndProcedure

&AtClient
Procedure Reload(Command)
	SetCapacityShow();
	GetCapacity();

EndProcedure
